ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dsu.h
/*
 * Component description for DSU
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-25T06:52:33Z */
#ifndef _SAMD21_DSU_COMPONENT_H_
#define _SAMD21_DSU_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR DSU                                          */
/* ************************************************************************** */

/* -------- DSU_CTRL : (DSU Offset: 0x00) ( /W 8) Control -------- */
#define DSU_CTRL_RESETVALUE _UINT8_(0x00) /*  (DSU_CTRL) Control  Reset Value */

#define DSU_CTRL_SWRST_Pos _UINT8_(0) /* (DSU_CTRL) Software Reset Position */
#define DSU_CTRL_SWRST_Msk (_UINT8_(0x1) << DSU_CTRL_SWRST_Pos) /* (DSU_CTRL) Software Reset Mask */
#define DSU_CTRL_SWRST(value)                                                                                          \
        (DSU_CTRL_SWRST_Msk &                                                                                          \
         (_UINT8_(value) << DSU_CTRL_SWRST_Pos)) /* Assigment of value for SWRST in the DSU_CTRL register */
#define DSU_CTRL_CRC_Pos _UINT8_(2) /* (DSU_CTRL) 32-bit Cyclic Redundancy Check Position */
#define DSU_CTRL_CRC_Msk (_UINT8_(0x1) << DSU_CTRL_CRC_Pos) /* (DSU_CTRL) 32-bit Cyclic Redundancy Check Mask */
#define DSU_CTRL_CRC(value)                                                                                            \
        (DSU_CTRL_CRC_Msk &                                                                                            \
         (_UINT8_(value) << DSU_CTRL_CRC_Pos)) /* Assigment of value for CRC in the DSU_CTRL register */
#define DSU_CTRL_MBIST_Pos _UINT8_(3) /* (DSU_CTRL) Memory Built-In Self-Test Position */
#define DSU_CTRL_MBIST_Msk (_UINT8_(0x1) << DSU_CTRL_MBIST_Pos) /* (DSU_CTRL) Memory Built-In Self-Test Mask */
#define DSU_CTRL_MBIST(value)                                                                                          \
        (DSU_CTRL_MBIST_Msk &                                                                                          \
         (_UINT8_(value) << DSU_CTRL_MBIST_Pos)) /* Assigment of value for MBIST in the DSU_CTRL register */
#define DSU_CTRL_CE_Pos _UINT8_(4) /* (DSU_CTRL) Chip Erase Position */
#define DSU_CTRL_CE_Msk (_UINT8_(0x1) << DSU_CTRL_CE_Pos) /* (DSU_CTRL) Chip Erase Mask */
#define DSU_CTRL_CE(value)                                                                                             \
        (DSU_CTRL_CE_Msk & (_UINT8_(value) << DSU_CTRL_CE_Pos)) /* Assigment of value for CE in the DSU_CTRL register  \
                                                                 */
#define DSU_CTRL_Msk _UINT8_(0x1D) /* (DSU_CTRL) Register Mask  */


/* -------- DSU_STATUSA : (DSU Offset: 0x01) (R/W 8) Status A -------- */
#define DSU_STATUSA_RESETVALUE _UINT8_(0x00) /*  (DSU_STATUSA) Status A  Reset Value */

#define DSU_STATUSA_DONE_Pos _UINT8_(0) /* (DSU_STATUSA) Done Position */
#define DSU_STATUSA_DONE_Msk (_UINT8_(0x1) << DSU_STATUSA_DONE_Pos) /* (DSU_STATUSA) Done Mask */
#define DSU_STATUSA_DONE(value)                                                                                        \
        (DSU_STATUSA_DONE_Msk &                                                                                        \
         (_UINT8_(value) << DSU_STATUSA_DONE_Pos)) /* Assigment of value for DONE in the DSU_STATUSA register */
#define DSU_STATUSA_CRSTEXT_Pos _UINT8_(1) /* (DSU_STATUSA) CPU Reset Phase Extension Position */
#define DSU_STATUSA_CRSTEXT_Msk                                                                                        \
        (_UINT8_(0x1) << DSU_STATUSA_CRSTEXT_Pos) /* (DSU_STATUSA) CPU Reset Phase Extension Mask */
#define DSU_STATUSA_CRSTEXT(value)                                                                                     \
        (DSU_STATUSA_CRSTEXT_Msk &                                                                                     \
         (_UINT8_(value) << DSU_STATUSA_CRSTEXT_Pos)) /* Assigment of value for CRSTEXT in the DSU_STATUSA register */
#define DSU_STATUSA_BERR_Pos _UINT8_(2) /* (DSU_STATUSA) Bus Error Position */
#define DSU_STATUSA_BERR_Msk (_UINT8_(0x1) << DSU_STATUSA_BERR_Pos) /* (DSU_STATUSA) Bus Error Mask */
#define DSU_STATUSA_BERR(value)                                                                                        \
        (DSU_STATUSA_BERR_Msk &                                                                                        \
         (_UINT8_(value) << DSU_STATUSA_BERR_Pos)) /* Assigment of value for BERR in the DSU_STATUSA register */
#define DSU_STATUSA_FAIL_Pos _UINT8_(3) /* (DSU_STATUSA) Failure Position */
#define DSU_STATUSA_FAIL_Msk (_UINT8_(0x1) << DSU_STATUSA_FAIL_Pos) /* (DSU_STATUSA) Failure Mask */
#define DSU_STATUSA_FAIL(value)                                                                                        \
        (DSU_STATUSA_FAIL_Msk &                                                                                        \
         (_UINT8_(value) << DSU_STATUSA_FAIL_Pos)) /* Assigment of value for FAIL in the DSU_STATUSA register */
#define DSU_STATUSA_PERR_Pos _UINT8_(4) /* (DSU_STATUSA) Protection Error Position */
#define DSU_STATUSA_PERR_Msk (_UINT8_(0x1) << DSU_STATUSA_PERR_Pos) /* (DSU_STATUSA) Protection Error Mask */
#define DSU_STATUSA_PERR(value)                                                                                        \
        (DSU_STATUSA_PERR_Msk &                                                                                        \
         (_UINT8_(value) << DSU_STATUSA_PERR_Pos)) /* Assigment of value for PERR in the DSU_STATUSA register */
#define DSU_STATUSA_Msk _UINT8_(0x1F) /* (DSU_STATUSA) Register Mask  */


/* -------- DSU_STATUSB : (DSU Offset: 0x02) ( R/ 8) Status B -------- */
#define DSU_STATUSB_RESETVALUE _UINT8_(0x10) /*  (DSU_STATUSB) Status B  Reset Value */

#define DSU_STATUSB_PROT_Pos _UINT8_(0) /* (DSU_STATUSB) Protected Position */
#define DSU_STATUSB_PROT_Msk (_UINT8_(0x1) << DSU_STATUSB_PROT_Pos) /* (DSU_STATUSB) Protected Mask */
#define DSU_STATUSB_PROT(value)                                                                                        \
        (DSU_STATUSB_PROT_Msk &                                                                                        \
         (_UINT8_(value) << DSU_STATUSB_PROT_Pos)) /* Assigment of value for PROT in the DSU_STATUSB register */
#define DSU_STATUSB_DBGPRES_Pos _UINT8_(1) /* (DSU_STATUSB) Debugger Present Position */
#define DSU_STATUSB_DBGPRES_Msk (_UINT8_(0x1) << DSU_STATUSB_DBGPRES_Pos) /* (DSU_STATUSB) Debugger Present Mask */
#define DSU_STATUSB_DBGPRES(value)                                                                                     \
        (DSU_STATUSB_DBGPRES_Msk &                                                                                     \
         (_UINT8_(value) << DSU_STATUSB_DBGPRES_Pos)) /* Assigment of value for DBGPRES in the DSU_STATUSB register */
#define DSU_STATUSB_DCCD0_Pos _UINT8_(2) /* (DSU_STATUSB) Debug Communication Channel 0 Dirty Position */
#define DSU_STATUSB_DCCD0_Msk                                                                                          \
        (_UINT8_(0x1) << DSU_STATUSB_DCCD0_Pos) /* (DSU_STATUSB) Debug Communication Channel 0 Dirty Mask */
#define DSU_STATUSB_DCCD0(value)                                                                                       \
        (DSU_STATUSB_DCCD0_Msk &                                                                                       \
         (_UINT8_(value) << DSU_STATUSB_DCCD0_Pos)) /* Assigment of value for DCCD0 in the DSU_STATUSB register */
#define DSU_STATUSB_DCCD1_Pos _UINT8_(3) /* (DSU_STATUSB) Debug Communication Channel 1 Dirty Position */
#define DSU_STATUSB_DCCD1_Msk                                                                                          \
        (_UINT8_(0x1) << DSU_STATUSB_DCCD1_Pos) /* (DSU_STATUSB) Debug Communication Channel 1 Dirty Mask */
#define DSU_STATUSB_DCCD1(value)                                                                                       \
        (DSU_STATUSB_DCCD1_Msk &                                                                                       \
         (_UINT8_(value) << DSU_STATUSB_DCCD1_Pos)) /* Assigment of value for DCCD1 in the DSU_STATUSB register */
#define DSU_STATUSB_HPE_Pos _UINT8_(4) /* (DSU_STATUSB) Hot-Plugging Enable Position */
#define DSU_STATUSB_HPE_Msk (_UINT8_(0x1) << DSU_STATUSB_HPE_Pos) /* (DSU_STATUSB) Hot-Plugging Enable Mask */
#define DSU_STATUSB_HPE(value)                                                                                         \
        (DSU_STATUSB_HPE_Msk &                                                                                         \
         (_UINT8_(value) << DSU_STATUSB_HPE_Pos)) /* Assigment of value for HPE in the DSU_STATUSB register */
#define DSU_STATUSB_Msk _UINT8_(0x1F) /* (DSU_STATUSB) Register Mask  */

