ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dsu.h
#define DSU_STATUSB_DCCD_Pos _UINT8_(2) /* (DSU_STATUSB Position) Debug Communication Channel x Dirty */
#define DSU_STATUSB_DCCD_Msk (_UINT8_(0x3) << DSU_STATUSB_DCCD_Pos) /* (DSU_STATUSB Mask) DCCD */
#define DSU_STATUSB_DCCD(value) (DSU_STATUSB_DCCD_Msk & (_UINT8_(value) << DSU_STATUSB_DCCD_Pos))

/* -------- DSU_ADDR : (DSU Offset: 0x04) (R/W 32) Address -------- */
#define DSU_ADDR_RESETVALUE _UINT32_(0x00) /*  (DSU_ADDR) Address  Reset Value */

#define DSU_ADDR_ADDR_Pos _UINT32_(2) /* (DSU_ADDR) Address Position */
#define DSU_ADDR_ADDR_Msk (_UINT32_(0x3FFFFFFF) << DSU_ADDR_ADDR_Pos) /* (DSU_ADDR) Address Mask */
#define DSU_ADDR_ADDR(value)                                                                                           \
        (DSU_ADDR_ADDR_Msk &                                                                                           \
         (_UINT32_(value) << DSU_ADDR_ADDR_Pos)) /* Assigment of value for ADDR in the DSU_ADDR register */
#define DSU_ADDR_Msk _UINT32_(0xFFFFFFFC) /* (DSU_ADDR) Register Mask  */


/* -------- DSU_LENGTH : (DSU Offset: 0x08) (R/W 32) Length -------- */
#define DSU_LENGTH_RESETVALUE _UINT32_(0x00) /*  (DSU_LENGTH) Length  Reset Value */

#define DSU_LENGTH_LENGTH_Pos _UINT32_(2) /* (DSU_LENGTH) Length Position */
#define DSU_LENGTH_LENGTH_Msk (_UINT32_(0x3FFFFFFF) << DSU_LENGTH_LENGTH_Pos) /* (DSU_LENGTH) Length Mask */
#define DSU_LENGTH_LENGTH(value)                                                                                       \
        (DSU_LENGTH_LENGTH_Msk &                                                                                       \
         (_UINT32_(value) << DSU_LENGTH_LENGTH_Pos)) /* Assigment of value for LENGTH in the DSU_LENGTH register */
#define DSU_LENGTH_Msk _UINT32_(0xFFFFFFFC) /* (DSU_LENGTH) Register Mask  */


/* -------- DSU_DATA : (DSU Offset: 0x0C) (R/W 32) Data -------- */
#define DSU_DATA_RESETVALUE _UINT32_(0x00) /*  (DSU_DATA) Data  Reset Value */

#define DSU_DATA_DATA_Pos _UINT32_(0) /* (DSU_DATA) Data Position */
#define DSU_DATA_DATA_Msk (_UINT32_(0xFFFFFFFF) << DSU_DATA_DATA_Pos) /* (DSU_DATA) Data Mask */
#define DSU_DATA_DATA(value)                                                                                           \
        (DSU_DATA_DATA_Msk &                                                                                           \
         (_UINT32_(value) << DSU_DATA_DATA_Pos)) /* Assigment of value for DATA in the DSU_DATA register */
#define DSU_DATA_Msk _UINT32_(0xFFFFFFFF) /* (DSU_DATA) Register Mask  */


/* -------- DSU_DCC : (DSU Offset: 0x10) (R/W 32) Debug Communication Channel n -------- */
#define DSU_DCC_RESETVALUE _UINT32_(0x00) /*  (DSU_DCC) Debug Communication Channel n  Reset Value */

#define DSU_DCC_DATA_Pos _UINT32_(0) /* (DSU_DCC) Data Position */
#define DSU_DCC_DATA_Msk (_UINT32_(0xFFFFFFFF) << DSU_DCC_DATA_Pos) /* (DSU_DCC) Data Mask */
#define DSU_DCC_DATA(value)                                                                                            \
        (DSU_DCC_DATA_Msk &                                                                                            \
         (_UINT32_(value) << DSU_DCC_DATA_Pos)) /* Assigment of value for DATA in the DSU_DCC register */
#define DSU_DCC_Msk _UINT32_(0xFFFFFFFF) /* (DSU_DCC) Register Mask  */


/* -------- DSU_DID : (DSU Offset: 0x18) ( R/ 32) Device Identification -------- */
#define DSU_DID_RESETVALUE _UINT32_(0x10010300) /*  (DSU_DID) Device Identification  Reset Value */

#define DSU_DID_DEVSEL_Pos _UINT32_(0) /* (DSU_DID) Device Select Position */
#define DSU_DID_DEVSEL_Msk (_UINT32_(0xFF) << DSU_DID_DEVSEL_Pos) /* (DSU_DID) Device Select Mask */
#define DSU_DID_DEVSEL(value)                                                                                          \
        (DSU_DID_DEVSEL_Msk &                                                                                          \
         (_UINT32_(value) << DSU_DID_DEVSEL_Pos)) /* Assigment of value for DEVSEL in the DSU_DID register */
#define DSU_DID_REVISION_Pos _UINT32_(8) /* (DSU_DID) Revision Position */
#define DSU_DID_REVISION_Msk (_UINT32_(0xF) << DSU_DID_REVISION_Pos) /* (DSU_DID) Revision Mask */
#define DSU_DID_REVISION(value)                                                                                        \
        (DSU_DID_REVISION_Msk &                                                                                        \
         (_UINT32_(value) << DSU_DID_REVISION_Pos)) /* Assigment of value for REVISION in the DSU_DID register */
#define DSU_DID_DIE_Pos _UINT32_(12) /* (DSU_DID) Die Identification Position */
#define DSU_DID_DIE_Msk (_UINT32_(0xF) << DSU_DID_DIE_Pos) /* (DSU_DID) Die Identification Mask */
#define DSU_DID_DIE(value)                                                                                             \
        (DSU_DID_DIE_Msk &                                                                                             \
         (_UINT32_(value) << DSU_DID_DIE_Pos)) /* Assigment of value for DIE in the DSU_DID register */
#define DSU_DID_SERIES_Pos _UINT32_(16) /* (DSU_DID) Product Series Position */
#define DSU_DID_SERIES_Msk (_UINT32_(0x3F) << DSU_DID_SERIES_Pos) /* (DSU_DID) Product Series Mask */
#define DSU_DID_SERIES(value)                                                                                          \
        (DSU_DID_SERIES_Msk &                                                                                          \
         (_UINT32_(value) << DSU_DID_SERIES_Pos)) /* Assigment of value for SERIES in the DSU_DID register */
#define DSU_DID_FAMILY_Pos _UINT32_(23) /* (DSU_DID) Product Family Position */
#define DSU_DID_FAMILY_Msk (_UINT32_(0x1F) << DSU_DID_FAMILY_Pos) /* (DSU_DID) Product Family Mask */
#define DSU_DID_FAMILY(value)                                                                                          \
        (DSU_DID_FAMILY_Msk &                                                                                          \
         (_UINT32_(value) << DSU_DID_FAMILY_Pos)) /* Assigment of value for FAMILY in the DSU_DID register */
#define DSU_DID_PROCESSOR_Pos _UINT32_(28) /* (DSU_DID) Processor Position */
#define DSU_DID_PROCESSOR_Msk (_UINT32_(0xF) << DSU_DID_PROCESSOR_Pos) /* (DSU_DID) Processor Mask */
#define DSU_DID_PROCESSOR(value)                                                                                       \
        (DSU_DID_PROCESSOR_Msk &                                                                                       \
         (_UINT32_(value) << DSU_DID_PROCESSOR_Pos)) /* Assigment of value for PROCESSOR in the DSU_DID register */
#define DSU_DID_Msk _UINT32_(0xFFBFFFFF) /* (DSU_DID) Register Mask  */


/* -------- DSU_ENTRY0 : (DSU Offset: 0x1000) ( R/ 32) CoreSight ROM Table Entry 0 -------- */
#define DSU_ENTRY0_RESETVALUE _UINT32_(0x9F9FC002) /*  (DSU_ENTRY0) CoreSight ROM Table Entry 0  Reset Value */

#define DSU_ENTRY0_EPRES_Pos _UINT32_(0) /* (DSU_ENTRY0) Entry Present Position */
#define DSU_ENTRY0_EPRES_Msk (_UINT32_(0x1) << DSU_ENTRY0_EPRES_Pos) /* (DSU_ENTRY0) Entry Present Mask */
#define DSU_ENTRY0_EPRES(value)                                                                                        \
        (DSU_ENTRY0_EPRES_Msk &                                                                                        \
         (_UINT32_(value) << DSU_ENTRY0_EPRES_Pos)) /* Assigment of value for EPRES in the DSU_ENTRY0 register */
#define DSU_ENTRY0_FMT_Pos _UINT32_(1) /* (DSU_ENTRY0) Format Position */
#define DSU_ENTRY0_FMT_Msk (_UINT32_(0x1) << DSU_ENTRY0_FMT_Pos) /* (DSU_ENTRY0) Format Mask */
#define DSU_ENTRY0_FMT(value)                                                                                          \
        (DSU_ENTRY0_FMT_Msk &                                                                                          \
         (_UINT32_(value) << DSU_ENTRY0_FMT_Pos)) /* Assigment of value for FMT in the DSU_ENTRY0 register */
#define DSU_ENTRY0_ADDOFF_Pos _UINT32_(12) /* (DSU_ENTRY0) Address Offset Position */
#define DSU_ENTRY0_ADDOFF_Msk (_UINT32_(0xFFFFF) << DSU_ENTRY0_ADDOFF_Pos) /* (DSU_ENTRY0) Address Offset Mask */
#define DSU_ENTRY0_ADDOFF(value)                                                                                       \
        (DSU_ENTRY0_ADDOFF_Msk &                                                                                       \
         (_UINT32_(value) << DSU_ENTRY0_ADDOFF_Pos)) /* Assigment of value for ADDOFF in the DSU_ENTRY0 register */
#define DSU_ENTRY0_Msk _UINT32_(0xFFFFF003) /* (DSU_ENTRY0) Register Mask  */


/* -------- DSU_ENTRY1 : (DSU Offset: 0x1004) ( R/ 32) CoreSight ROM Table Entry 1 -------- */
#define DSU_ENTRY1_RESETVALUE _UINT32_(0x3002) /*  (DSU_ENTRY1) CoreSight ROM Table Entry 1  Reset Value */

