ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dsu.h
#define DSU_ENTRY1_Msk _UINT32_(0x00000000) /* (DSU_ENTRY1) Register Mask  */


/* -------- DSU_END : (DSU Offset: 0x1008) ( R/ 32) CoreSight ROM Table End -------- */
#define DSU_END_RESETVALUE _UINT32_(0x00) /*  (DSU_END) CoreSight ROM Table End  Reset Value */

#define DSU_END_END_Pos _UINT32_(0) /* (DSU_END) End Marker Position */
#define DSU_END_END_Msk (_UINT32_(0xFFFFFFFF) << DSU_END_END_Pos) /* (DSU_END) End Marker Mask */
#define DSU_END_END(value)                                                                                             \
        (DSU_END_END_Msk &                                                                                             \
         (_UINT32_(value) << DSU_END_END_Pos)) /* Assigment of value for END in the DSU_END register */
#define DSU_END_Msk _UINT32_(0xFFFFFFFF) /* (DSU_END) Register Mask  */


/* -------- DSU_MEMTYPE : (DSU Offset: 0x1FCC) ( R/ 32) CoreSight ROM Table Memory Type -------- */
#define DSU_MEMTYPE_RESETVALUE _UINT32_(0x00) /*  (DSU_MEMTYPE) CoreSight ROM Table Memory Type  Reset Value */

#define DSU_MEMTYPE_SMEMP_Pos _UINT32_(0) /* (DSU_MEMTYPE) System Memory Present Position */
#define DSU_MEMTYPE_SMEMP_Msk (_UINT32_(0x1) << DSU_MEMTYPE_SMEMP_Pos) /* (DSU_MEMTYPE) System Memory Present Mask */
#define DSU_MEMTYPE_SMEMP(value)                                                                                       \
        (DSU_MEMTYPE_SMEMP_Msk &                                                                                       \
         (_UINT32_(value) << DSU_MEMTYPE_SMEMP_Pos)) /* Assigment of value for SMEMP in the DSU_MEMTYPE register */
#define DSU_MEMTYPE_Msk _UINT32_(0x00000001) /* (DSU_MEMTYPE) Register Mask  */


/* -------- DSU_PID4 : (DSU Offset: 0x1FD0) ( R/ 32) Peripheral Identification 4 -------- */
#define DSU_PID4_RESETVALUE _UINT32_(0x00) /*  (DSU_PID4) Peripheral Identification 4  Reset Value */

#define DSU_PID4_JEPCC_Pos _UINT32_(0) /* (DSU_PID4) JEP-106 Continuation Code Position */
#define DSU_PID4_JEPCC_Msk (_UINT32_(0xF) << DSU_PID4_JEPCC_Pos) /* (DSU_PID4) JEP-106 Continuation Code Mask */
#define DSU_PID4_JEPCC(value)                                                                                          \
        (DSU_PID4_JEPCC_Msk &                                                                                          \
         (_UINT32_(value) << DSU_PID4_JEPCC_Pos)) /* Assigment of value for JEPCC in the DSU_PID4 register */
#define DSU_PID4_FKBC_Pos _UINT32_(4) /* (DSU_PID4) 4KB Count Position */
#define DSU_PID4_FKBC_Msk (_UINT32_(0xF) << DSU_PID4_FKBC_Pos) /* (DSU_PID4) 4KB Count Mask */
#define DSU_PID4_FKBC(value)                                                                                           \
        (DSU_PID4_FKBC_Msk &                                                                                           \
         (_UINT32_(value) << DSU_PID4_FKBC_Pos)) /* Assigment of value for FKBC in the DSU_PID4 register */
#define DSU_PID4_Msk _UINT32_(0x000000FF) /* (DSU_PID4) Register Mask  */


/* -------- DSU_PID0 : (DSU Offset: 0x1FE0) ( R/ 32) Peripheral Identification 0 -------- */
#define DSU_PID0_RESETVALUE _UINT32_(0xD0) /*  (DSU_PID0) Peripheral Identification 0  Reset Value */

#define DSU_PID0_PARTNBL_Pos _UINT32_(0) /* (DSU_PID0) Part Number Low Position */
#define DSU_PID0_PARTNBL_Msk (_UINT32_(0xFF) << DSU_PID0_PARTNBL_Pos) /* (DSU_PID0) Part Number Low Mask */
#define DSU_PID0_PARTNBL(value)                                                                                        \
        (DSU_PID0_PARTNBL_Msk &                                                                                        \
         (_UINT32_(value) << DSU_PID0_PARTNBL_Pos)) /* Assigment of value for PARTNBL in the DSU_PID0 register */
#define DSU_PID0_Msk _UINT32_(0x000000FF) /* (DSU_PID0) Register Mask  */


/* -------- DSU_PID1 : (DSU Offset: 0x1FE4) ( R/ 32) Peripheral Identification 1 -------- */
#define DSU_PID1_RESETVALUE _UINT32_(0xFC) /*  (DSU_PID1) Peripheral Identification 1  Reset Value */

#define DSU_PID1_PARTNBH_Pos _UINT32_(0) /* (DSU_PID1) Part Number High Position */
#define DSU_PID1_PARTNBH_Msk (_UINT32_(0xF) << DSU_PID1_PARTNBH_Pos) /* (DSU_PID1) Part Number High Mask */
#define DSU_PID1_PARTNBH(value)                                                                                        \
        (DSU_PID1_PARTNBH_Msk &                                                                                        \
         (_UINT32_(value) << DSU_PID1_PARTNBH_Pos)) /* Assigment of value for PARTNBH in the DSU_PID1 register */
#define DSU_PID1_JEPIDCL_Pos _UINT32_(4) /* (DSU_PID1) Low part of the JEP-106 Identity Code Position */
#define DSU_PID1_JEPIDCL_Msk                                                                                           \
        (_UINT32_(0xF) << DSU_PID1_JEPIDCL_Pos) /* (DSU_PID1) Low part of the JEP-106 Identity Code Mask */
#define DSU_PID1_JEPIDCL(value)                                                                                        \
        (DSU_PID1_JEPIDCL_Msk &                                                                                        \
         (_UINT32_(value) << DSU_PID1_JEPIDCL_Pos)) /* Assigment of value for JEPIDCL in the DSU_PID1 register */
#define DSU_PID1_Msk _UINT32_(0x000000FF) /* (DSU_PID1) Register Mask  */


/* -------- DSU_PID2 : (DSU Offset: 0x1FE8) ( R/ 32) Peripheral Identification 2 -------- */
#define DSU_PID2_RESETVALUE _UINT32_(0x09) /*  (DSU_PID2) Peripheral Identification 2  Reset Value */

#define DSU_PID2_JEPIDCH_Pos _UINT32_(0) /* (DSU_PID2) JEP-106 Identity Code High Position */
#define DSU_PID2_JEPIDCH_Msk (_UINT32_(0x7) << DSU_PID2_JEPIDCH_Pos) /* (DSU_PID2) JEP-106 Identity Code High Mask */
#define DSU_PID2_JEPIDCH(value)                                                                                        \
        (DSU_PID2_JEPIDCH_Msk &                                                                                        \
         (_UINT32_(value) << DSU_PID2_JEPIDCH_Pos)) /* Assigment of value for JEPIDCH in the DSU_PID2 register */
#define DSU_PID2_JEPU_Pos _UINT32_(3) /* (DSU_PID2) JEP-106 Identity Code is used Position */
#define DSU_PID2_JEPU_Msk (_UINT32_(0x1) << DSU_PID2_JEPU_Pos) /* (DSU_PID2) JEP-106 Identity Code is used Mask */
#define DSU_PID2_JEPU(value)                                                                                           \
        (DSU_PID2_JEPU_Msk &                                                                                           \
         (_UINT32_(value) << DSU_PID2_JEPU_Pos)) /* Assigment of value for JEPU in the DSU_PID2 register */
#define DSU_PID2_REVISION_Pos _UINT32_(4) /* (DSU_PID2) Revision Number Position */
#define DSU_PID2_REVISION_Msk (_UINT32_(0xF) << DSU_PID2_REVISION_Pos) /* (DSU_PID2) Revision Number Mask */
#define DSU_PID2_REVISION(value)                                                                                       \
        (DSU_PID2_REVISION_Msk &                                                                                       \
         (_UINT32_(value) << DSU_PID2_REVISION_Pos)) /* Assigment of value for REVISION in the DSU_PID2 register */
#define DSU_PID2_Msk _UINT32_(0x000000FF) /* (DSU_PID2) Register Mask  */


/* -------- DSU_PID3 : (DSU Offset: 0x1FEC) ( R/ 32) Peripheral Identification 3 -------- */
#define DSU_PID3_RESETVALUE _UINT32_(0x00) /*  (DSU_PID3) Peripheral Identification 3  Reset Value */

#define DSU_PID3_CUSMOD_Pos _UINT32_(0) /* (DSU_PID3) ARM CUSMOD Position */
#define DSU_PID3_CUSMOD_Msk (_UINT32_(0xF) << DSU_PID3_CUSMOD_Pos) /* (DSU_PID3) ARM CUSMOD Mask */
#define DSU_PID3_CUSMOD(value)                                                                                         \
        (DSU_PID3_CUSMOD_Msk &                                                                                         \
         (_UINT32_(value) << DSU_PID3_CUSMOD_Pos)) /* Assigment of value for CUSMOD in the DSU_PID3 register */
#define DSU_PID3_REVAND_Pos _UINT32_(4) /* (DSU_PID3) Revision Number Position */
#define DSU_PID3_REVAND_Msk (_UINT32_(0xF) << DSU_PID3_REVAND_Pos) /* (DSU_PID3) Revision Number Mask */
#define DSU_PID3_REVAND(value)                                                                                         \
        (DSU_PID3_REVAND_Msk &                                                                                         \
         (_UINT32_(value) << DSU_PID3_REVAND_Pos)) /* Assigment of value for REVAND in the DSU_PID3 register */
#define DSU_PID3_Msk _UINT32_(0x000000FF) /* (DSU_PID3) Register Mask  */


/* -------- DSU_CID0 : (DSU Offset: 0x1FF0) ( R/ 32) Component Identification 0 -------- */
#define DSU_CID0_RESETVALUE _UINT32_(0x0D) /*  (DSU_CID0) Component Identification 0  Reset Value */

