ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dsu.h
#define DSU_CID0_PREAMBLEB0_Pos _UINT32_(0) /* (DSU_CID0) Preamble Byte 0 Position */
#define DSU_CID0_PREAMBLEB0_Msk (_UINT32_(0xFF) << DSU_CID0_PREAMBLEB0_Pos) /* (DSU_CID0) Preamble Byte 0 Mask */
#define DSU_CID0_PREAMBLEB0(value)                                                                                     \
        (DSU_CID0_PREAMBLEB0_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DSU_CID0_PREAMBLEB0_Pos)) /* Assigment of value for PREAMBLEB0 in the DSU_CID0 register */
#define DSU_CID0_Msk _UINT32_(0x000000FF) /* (DSU_CID0) Register Mask  */


/* -------- DSU_CID1 : (DSU Offset: 0x1FF4) ( R/ 32) Component Identification 1 -------- */
#define DSU_CID1_RESETVALUE _UINT32_(0x10) /*  (DSU_CID1) Component Identification 1  Reset Value */

#define DSU_CID1_PREAMBLE_Pos _UINT32_(0) /* (DSU_CID1) Preamble Position */
#define DSU_CID1_PREAMBLE_Msk (_UINT32_(0xF) << DSU_CID1_PREAMBLE_Pos) /* (DSU_CID1) Preamble Mask */
#define DSU_CID1_PREAMBLE(value)                                                                                       \
        (DSU_CID1_PREAMBLE_Msk &                                                                                       \
         (_UINT32_(value) << DSU_CID1_PREAMBLE_Pos)) /* Assigment of value for PREAMBLE in the DSU_CID1 register */
#define DSU_CID1_CCLASS_Pos _UINT32_(4) /* (DSU_CID1) Component Class Position */
#define DSU_CID1_CCLASS_Msk (_UINT32_(0xF) << DSU_CID1_CCLASS_Pos) /* (DSU_CID1) Component Class Mask */
#define DSU_CID1_CCLASS(value)                                                                                         \
        (DSU_CID1_CCLASS_Msk &                                                                                         \
         (_UINT32_(value) << DSU_CID1_CCLASS_Pos)) /* Assigment of value for CCLASS in the DSU_CID1 register */
#define DSU_CID1_Msk _UINT32_(0x000000FF) /* (DSU_CID1) Register Mask  */


/* -------- DSU_CID2 : (DSU Offset: 0x1FF8) ( R/ 32) Component Identification 2 -------- */
#define DSU_CID2_RESETVALUE _UINT32_(0x05) /*  (DSU_CID2) Component Identification 2  Reset Value */

#define DSU_CID2_PREAMBLEB2_Pos _UINT32_(0) /* (DSU_CID2) Preamble Byte 2 Position */
#define DSU_CID2_PREAMBLEB2_Msk (_UINT32_(0xFF) << DSU_CID2_PREAMBLEB2_Pos) /* (DSU_CID2) Preamble Byte 2 Mask */
#define DSU_CID2_PREAMBLEB2(value)                                                                                     \
        (DSU_CID2_PREAMBLEB2_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DSU_CID2_PREAMBLEB2_Pos)) /* Assigment of value for PREAMBLEB2 in the DSU_CID2 register */
#define DSU_CID2_Msk _UINT32_(0x000000FF) /* (DSU_CID2) Register Mask  */


/* -------- DSU_CID3 : (DSU Offset: 0x1FFC) ( R/ 32) Component Identification 3 -------- */
#define DSU_CID3_RESETVALUE _UINT32_(0xB1) /*  (DSU_CID3) Component Identification 3  Reset Value */

#define DSU_CID3_PREAMBLEB3_Pos _UINT32_(0) /* (DSU_CID3) Preamble Byte 3 Position */
#define DSU_CID3_PREAMBLEB3_Msk (_UINT32_(0xFF) << DSU_CID3_PREAMBLEB3_Pos) /* (DSU_CID3) Preamble Byte 3 Mask */
#define DSU_CID3_PREAMBLEB3(value)                                                                                     \
        (DSU_CID3_PREAMBLEB3_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DSU_CID3_PREAMBLEB3_Pos)) /* Assigment of value for PREAMBLEB3 in the DSU_CID3 register */
#define DSU_CID3_Msk _UINT32_(0x000000FF) /* (DSU_CID3) Register Mask  */


/** \brief DSU register offsets definitions */
#define DSU_CTRL_REG_OFST _UINT32_(0x00) /* (DSU_CTRL) Control Offset */
#define DSU_STATUSA_REG_OFST _UINT32_(0x01) /* (DSU_STATUSA) Status A Offset */
#define DSU_STATUSB_REG_OFST _UINT32_(0x02) /* (DSU_STATUSB) Status B Offset */
#define DSU_ADDR_REG_OFST _UINT32_(0x04) /* (DSU_ADDR) Address Offset */
#define DSU_LENGTH_REG_OFST _UINT32_(0x08) /* (DSU_LENGTH) Length Offset */
#define DSU_DATA_REG_OFST _UINT32_(0x0C) /* (DSU_DATA) Data Offset */
#define DSU_DCC_REG_OFST _UINT32_(0x10) /* (DSU_DCC) Debug Communication Channel n Offset */
#define DSU_DCC0_REG_OFST _UINT32_(0x10) /* (DSU_DCC0) Debug Communication Channel n Offset */
#define DSU_DCC1_REG_OFST _UINT32_(0x14) /* (DSU_DCC1) Debug Communication Channel n Offset */
#define DSU_DID_REG_OFST _UINT32_(0x18) /* (DSU_DID) Device Identification Offset */
#define DSU_ENTRY0_REG_OFST _UINT32_(0x1000) /* (DSU_ENTRY0) CoreSight ROM Table Entry 0 Offset */
#define DSU_ENTRY1_REG_OFST _UINT32_(0x1004) /* (DSU_ENTRY1) CoreSight ROM Table Entry 1 Offset */
#define DSU_END_REG_OFST _UINT32_(0x1008) /* (DSU_END) CoreSight ROM Table End Offset */
#define DSU_MEMTYPE_REG_OFST _UINT32_(0x1FCC) /* (DSU_MEMTYPE) CoreSight ROM Table Memory Type Offset */
#define DSU_PID4_REG_OFST _UINT32_(0x1FD0) /* (DSU_PID4) Peripheral Identification 4 Offset */
#define DSU_PID0_REG_OFST _UINT32_(0x1FE0) /* (DSU_PID0) Peripheral Identification 0 Offset */
#define DSU_PID1_REG_OFST _UINT32_(0x1FE4) /* (DSU_PID1) Peripheral Identification 1 Offset */
#define DSU_PID2_REG_OFST _UINT32_(0x1FE8) /* (DSU_PID2) Peripheral Identification 2 Offset */
#define DSU_PID3_REG_OFST _UINT32_(0x1FEC) /* (DSU_PID3) Peripheral Identification 3 Offset */
#define DSU_CID0_REG_OFST _UINT32_(0x1FF0) /* (DSU_CID0) Component Identification 0 Offset */
#define DSU_CID1_REG_OFST _UINT32_(0x1FF4) /* (DSU_CID1) Component Identification 1 Offset */
#define DSU_CID2_REG_OFST _UINT32_(0x1FF8) /* (DSU_CID2) Component Identification 2 Offset */
#define DSU_CID3_REG_OFST _UINT32_(0x1FFC) /* (DSU_CID3) Component Identification 3 Offset */

