ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dsu.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief DSU register API structure */
typedef struct { /* Device Service Unit */
        __O uint8_t DSU_CTRL; /**< Offset: 0x00 ( /W  8) Control */
        __IO uint8_t DSU_STATUSA; /**< Offset: 0x01 (R/W  8) Status A */
        __I uint8_t DSU_STATUSB; /**< Offset: 0x02 (R/   8) Status B */
        __I uint8_t Reserved1[0x01];
        __IO uint32_t DSU_ADDR; /**< Offset: 0x04 (R/W  32) Address */
        __IO uint32_t DSU_LENGTH; /**< Offset: 0x08 (R/W  32) Length */
        __IO uint32_t DSU_DATA; /**< Offset: 0x0C (R/W  32) Data */
        __IO uint32_t DSU_DCC[2]; /**< Offset: 0x10 (R/W  32) Debug Communication Channel n */
        __I uint32_t DSU_DID; /**< Offset: 0x18 (R/   32) Device Identification */
        __I uint8_t Reserved2[0xFE4];
        __I uint32_t DSU_ENTRY0; /**< Offset: 0x1000 (R/   32) CoreSight ROM Table Entry 0 */
        __I uint32_t DSU_ENTRY1; /**< Offset: 0x1004 (R/   32) CoreSight ROM Table Entry 1 */
        __I uint32_t DSU_END; /**< Offset: 0x1008 (R/   32) CoreSight ROM Table End */
        __I uint8_t Reserved3[0xFC0];
        __I uint32_t DSU_MEMTYPE; /**< Offset: 0x1FCC (R/   32) CoreSight ROM Table Memory Type */
        __I uint32_t DSU_PID4; /**< Offset: 0x1FD0 (R/   32) Peripheral Identification 4 */
        __I uint8_t Reserved4[0x0C];
        __I uint32_t DSU_PID0; /**< Offset: 0x1FE0 (R/   32) Peripheral Identification 0 */
        __I uint32_t DSU_PID1; /**< Offset: 0x1FE4 (R/   32) Peripheral Identification 1 */
        __I uint32_t DSU_PID2; /**< Offset: 0x1FE8 (R/   32) Peripheral Identification 2 */
        __I uint32_t DSU_PID3; /**< Offset: 0x1FEC (R/   32) Peripheral Identification 3 */
        __I uint32_t DSU_CID0; /**< Offset: 0x1FF0 (R/   32) Component Identification 0 */
        __I uint32_t DSU_CID1; /**< Offset: 0x1FF4 (R/   32) Component Identification 1 */
        __I uint32_t DSU_CID2; /**< Offset: 0x1FF8 (R/   32) Component Identification 2 */
        __I uint32_t DSU_CID3; /**< Offset: 0x1FFC (R/   32) Component Identification 3 */
} dsu_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_DSU_COMPONENT_H_ */
